app/controllers/books_controller.rb

SELECT * FROM "books"
---
  def index
    @books = Book.all

SELECT * FROM "books" WHERE ("books"."id" = 1)
---
  def show
    @book = Book.find(params[:id])

INSERT INTO "books" ("created_at", "title", "updated_at", "loaned", "description") VALUES('2009-11-07 18:34:16', 'The Rails Way', '2009-11-07 18:34:16', 'f', 'http://www.amazon.ca/Rails-Way-Obie-Fernandez/dp/0321445619/ref=sr_1_1?ie=UTF8&s=books&qid=1257618843&sr=8-1')
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save