app/controllers/members_controller.rb

SELECT * FROM "members"
---
  def index
    @members = Member.all

SELECT * FROM "members" WHERE ("members"."id" = 1)
---
  def show
    @member = Member.find(params[:id])

INSERT INTO "members" ("name", "created_at", "updated_at", "contact") VALUES('Miles K. Forrest', '2009-11-07 18:32:26', '2009-11-07 18:32:26', 'http://coderpath.com')
---
  def create
    @member = Member.new(params[:member])

    respond_to do |format|
      if @member.save